set_device -family {PolarFire} -die {MPF300TS_ES}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\User\GlueLogic\AXI_GLUE_LOGIC\1.0.7\vlog\AXI_glue_logic.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Clock_gen.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Rx_async.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Tx_async.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\fifo_256x8_g5.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\CoreUART.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\lsram\COREAHBLSRAM_PF_0\rtl\vlog\core\CoreAHBLSRAM_AHBLSramIf.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\lsram\COREAHBLSRAM_PF_0\rtl\vlog\core\CoreAHBLSRAM_PF.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\lsram\PF_TPSRAM_AHB_AXI_0\lsram_PF_TPSRAM_AHB_AXI_0_PF_TPSRAM.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\lsram\lsram.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_addrdec.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_defaultslavesm.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_masterstage.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavearbiter.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavestage.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_matrix4x16.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core_obfuscated\coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core_obfuscated\coreahbtoapb3_penablescheduler.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core_obfuscated\coreahbtoapb3_apbaddrdata.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core_obfuscated\coreahbtoapb3.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AHBMasterCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXIOutReg.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBAddrOffset.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBPopCntr.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_readByteCnt.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXISlaveCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_RAM_syncWrAsyncRd.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_synchronizer.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREJTAGDEBUG\2.0.100\rtl\vlog\core\corejtagdebug_uj_jtag.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\COREJTAGDEBUG\2.0.100\rtl\vlog\core\corejtagdebug.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_async_fifo.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_debug_transport_module_jtag.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_arbiter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_arbiter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_arbiter_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_arbiter_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_d_cache_data_array_g5.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_finish_queue.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_metadata_array.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tlb.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_d_cache.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_flow_through_serializer.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_i_cache.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_frontend.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_hella_cache_arbiter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_alu.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_breakpoint_unit.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_csr_file.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_mul_div.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_rocket.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_rocket_tile.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_debug_module.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_level_gateway.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_id_mapper.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_arbiter_1.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_reorder_queue_3.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_nasti_io_tile_link_io_converter_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_tile_link_enqueuer.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_5.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_reorder_queue.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_tile_link_io_unwrapper.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_manager_to_client_stateless_bridge.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_mmio_tile_link_manager.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_arbiter.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_reorder_queue_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_nasti_io_tile_link_io_converter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_3.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus_3.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_4.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus_4.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_tile_link_network_port.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_finish_queue_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_finish_unit.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_network_port.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_manager_tile_link_network_port.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_manager_tile_link_network_port_1.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_1.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_2.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_3.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_enqueuer.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_enqueuer_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_enqueuer_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_ported_tile_link_crossbar.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_10.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_12.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_13.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_14.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_8.v}
 add_include_path  {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_9.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_arbiter_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_memory_interconnect.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_outer_memory_system.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_plic.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_prci.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_rom_slave.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_6.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_router.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_crossbar.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_7.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_router_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_crossbar_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_recursive_interconnect_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_recursive_interconnect.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_uncore.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_top.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4.v}
read_verilog -mode verilog_2k -lib CORESYSSERVICES_PF_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CORESYSSERVICES_PF\2.2.102\rtl\vlog\core\CoreSysServices_PF_APBS.v}
read_verilog -mode verilog_2k -lib CORESYSSERVICES_PF_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CORESYSSERVICES_PF\2.2.102\rtl\vlog\core\CoreSysServices_PF_MBXIF.v}
read_verilog -mode verilog_2k -lib CORESYSSERVICES_PF_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CORESYSSERVICES_PF\2.2.102\rtl\vlog\core\CoreSysServices_PF_ReqArbiter.v}
read_verilog -mode verilog_2k -lib CORESYSSERVICES_PF_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CORESYSSERVICES_PF\2.2.102\rtl\vlog\core\CoreSysServices_PF_SSIIF.v}
read_verilog -mode verilog_2k -lib CORESYSSERVICES_PF_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\Actel\DirectCore\CORESYSSERVICES_PF\2.2.102\rtl\vlog\core\CoreSysServices_PF_Ctrl.v}
read_verilog -mode verilog_2k -lib CORESYSSERVICES_PF_LIB {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\CORESYSSERVICES_PF_0\rtl\vlog\core\CoreSysServices_PF.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\PROC_SUBSYSTEM\PROC_SUBSYSTEM.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\RISCV_TOP\PF_CCC_0\RISCV_TOP_PF_CCC_0_PF_CCC.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\hdl\LED_BLINK.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\hdl\reset_synchronizer.v}
read_verilog -mode verilog_2k {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\RISCV_TOP\RISCV_TOP.v}
set_top_level {RISCV_TOP}
read_sdc -component {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\component\work\RISCV_TOP\PF_CCC_0\RISCV_TOP_PF_CCC_0_PF_CCC.sdc}
derive_constraints
write_sdc {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\constraint\RISCV_TOP_derived_constraints.sdc}
write_pdc {D:\exp\MPF300T-PolarFire-Eval-Kit\Modify_The_FPGA_Design\PF_CoreRISCV_AXI4_SysServices\constraint\fp\RISCV_TOP_derived_constraints.pdc}
